In [40]:
                # Methods Of DataFrame : Merging And Joining & Reshaping And Transformation

In [41]:
import pandas as pd

In [42]:
s1 = pd.read_csv("../../Data/marine economy.csv")

In [43]:
data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Age': [25, 30, 35],
'Salary': [50000, 60000, 75000]}
df = pd.DataFrame(data)
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000

In [44]:
data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Age': [25, 30, 35],
'Salary': [50000, 60000, 75000]}
df = pd.DataFrame(data)
print(df)

def calculate_tax(Salary):
    return Salary * 0.12

df['tax']= df['Salary'].apply(calculate_tax)
print("\nDataFrame with Tax column: ")
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000

DataFrame with Tax column:
      Name  Age  Salary     tax
0    Alice   25   50000  6000.0
1      Bob   30   60000  7200.0
2  Charlie   35   75000  9000.0

In [45]:
s1_rollings = s1['average_data_value']= s1['data_value'].rolling(window=2).mean()
print(s1_rollings)

0           NaN
1         40.75
2         39.65
3         40.35
4         40.35
         ...
709    36916.50
710    38481.00
711    39373.50
712    40230.00
713    40033.50
Name: data_value, Length: 714, dtype: float64

In [46]:
s1_expanding = df['Expanding_mean_Salary'] = df['Salary'].expanding().mean()
print(s1_expanding)

0    50000.000000
1    55000.000000
2    61666.666667
Name: Salary, dtype: float64

In [47]:
df['ewm_salary']=df['Salary'].ewm(span=2).mean()
print(df)

      Name  Age  Salary     tax  Expanding_mean_Salary    ewm_salary
0    Alice   25   50000  6000.0           50000.000000  50000.000000
1      Bob   30   60000  7200.0           55000.000000  57500.000000
2  Charlie   35   75000  9000.0           61666.666667  69615.384615

In [48]:
df1 = pd.DataFrame({'EmployeeID': [101, 102, 103, 104],
                   'Name': ['Alice', 'Bob', 'Charlie', 'David'],
                   'Department': ['HR', 'Finance', 'IT', 'Marketing']})

df2 = pd.DataFrame({'EmployeeID': [102, 103, 104, 105],
                    'Salary': [60000, 75000, 58000, 52000],
                    'JoiningYear': [2015, 2016, 2017, 2018]})


# Merge DataFrames on 'EmployeeID' withinner join (default)
result_inner = pd.merge(df1,df2,on='EmployeeID')
print(result_inner)

   EmployeeID     Name Department  Salary  JoiningYear
0         102      Bob    Finance   60000         2015
1         103  Charlie         IT   75000         2016
2         104    David  Marketing   58000         2017

In [49]:
# Merge DataFrames on 'EmployeeID' with left join
result_left = pd.merge(df1,df2,on='EmployeeID',how='left')
print(result_left)

   EmployeeID     Name Department   Salary  JoiningYear
0         101    Alice         HR      NaN          NaN
1         102      Bob    Finance  60000.0       2015.0
2         103  Charlie         IT  75000.0       2016.0
3         104    David  Marketing  58000.0       2017.0

In [60]:
# Merge DataFrames on 'EmployeeID' with outer join
result_outer = pd.merge(df1,df2,on='EmployeeID',how='outer')
print(result_outer)

   EmployeeID     Name Department   Salary  JoiningYear
0         101    Alice         HR      NaN          NaN
1         102      Bob    Finance  60000.0       2015.0
2         103  Charlie         IT  75000.0       2016.0
3         104    David  Marketing  58000.0       2017.0
4         105      NaN        NaN  52000.0       2018.0

In [62]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie', 'David'],
                    'Department': ['HR', 'Finance', 'IT', 'Marketing']}, 
                    index=[101, 102, 103, 104])
#print('\n',df1)
df2 = pd.DataFrame({'Salary': [60000, 75000, 58000, 52000],
                      'JoiningYear': [2015, 2016, 2017, 2018]}, 
                      index=[102, 103, 104, 105])
#print('\n',df2)
# Join df2 to df1 on their indices with inner join
result_inner = df1.join(df2, how='inner')
print("\nInner Join (Only matching indices):")
print(result_inner)

Inner Join (Only matching indices):
        Name Department  Salary  JoiningYear
102      Bob    Finance   60000         2015
103  Charlie         IT   75000         2016
104    David  Marketing   58000         2017

In [63]:
# Join df2 to df1 on their indices with left join
result_left = df1.join(df2,how='left')
print(result_left)

        Name Department   Salary  JoiningYear
101    Alice         HR      NaN          NaN
102      Bob    Finance  60000.0       2015.0
103  Charlie         IT  75000.0       2016.0
104    David  Marketing  58000.0       2017.0

In [64]:
# Join df2 to df1 on their indices with outer join
result_outer = df1.join(df2,how='outer')
print(result_outer)

        Name Department   Salary  JoiningYear
101    Alice         HR      NaN          NaN
102      Bob    Finance  60000.0       2015.0
103  Charlie         IT  75000.0       2016.0
104    David  Marketing  58000.0       2017.0
105      NaN        NaN  52000.0       2018.0

In [65]:
df1 = pd.DataFrame({'EmployeeID': [101, 102, 103],
                    'Name': ['Alice', 'Bob', 'Charlie'] })
df2 = pd.DataFrame({'EmployeeID': [104, 105],
                    'Name': ['David', 'Eva']})
df3 = pd.DataFrame({'EmployeeID': [106, 107],
                    'Name': ['Frank', 'Grace']})

# Concatenate DataFrames along rows (axis=0)
result_rows = pd.concat([df1,df2,df3],axis=0)
print(result_rows)

   EmployeeID     Name
0         101    Alice
1         102      Bob
2         103  Charlie
0         104    David
1         105      Eva
0         106    Frank
1         107    Grace

In [66]:
# Concatenate DataFrames along columns (axis=1)
result_rows = pd.concat([df1,df2,df3],axis=1)
print(result_rows)

   EmployeeID     Name  EmployeeID   Name  EmployeeID   Name
0         101    Alice       104.0  David       106.0  Frank
1         102      Bob       105.0    Eva       107.0  Grace
2         103  Charlie         NaN    NaN         NaN    NaN

In [73]:
# For this, we need to create DataFrames with the same number of rows
df4 = pd.DataFrame({'Department': ['HR', 'Finance', 'IT','Marketing', 'Sales', 'Support']})
result_colnum = pd.concat([result_rows,df4],axis=1).reset_index()
print(result_colnum)

   index  EmployeeID     Name  EmployeeID   Name  EmployeeID   Name Department
0      0       101.0    Alice       104.0  David       106.0  Frank         HR
1      1       102.0      Bob       105.0    Eva       107.0  Grace    Finance
2      2       103.0  Charlie         NaN    NaN         NaN    NaN         IT
3      3         NaN      NaN         NaN    NaN         NaN    NaN  Marketing
4      4         NaN      NaN         NaN    NaN         NaN    NaN      Sales
5      5         NaN      NaN         NaN    NaN         NaN    NaN    Support